#+TITLE: AERES Project Management

*** TODO [#C] Bounded look-ahead sum                                  :@code:
    :LOGBOOK:
    CLOCK: [2023-09-11 Mon 15:15]--[2023-09-11 Mon 16:15] =>  1:00
    :END:
*** DONE [#A] Fix RDN specification                                   :@code:
    CLOSED: [2023-09-18 Mon 11:59]
    - State "DONE"       from "TODO"       [2023-09-18 Mon 11:59]
    :LOGBOOK:
    CLOCK: [2023-09-13 Wed 09:35]--[2023-09-13 Wed 10:35] =>  1:00
    CLOCK: [2023-09-12 Tue 13:05]--[2023-09-12 Tue 16:05] =>  3:00
    CLOCK: [2023-09-12 Tue 10:00]--[2023-09-12 Tue 12:00] =>  2:00
    :END:
*** DONE [#A] Time and validity correctness                           :@code:
    CLOSED: [2023-10-23 Mon 11:08]
    - State "DONE"       from "TODO"       [2023-10-23 Mon 11:08]
    :LOGBOOK:
    CLOCK: [2023-10-06 Fri 09:50]--[2023-10-06 Fri 18:00] =>  8:10
    CLOCK: [2023-10-06 Fri 09:05]--[2023-10-06 Fri 10:05] =>  1:00
    :END:
*** DONE Add SetOf specification                                      :@code:
    CLOSED: [2023-10-23 Mon 11:07]
    - State "DONE"       from "TODO"       [2023-10-23 Mon 11:07] \\
      Added, and RDN has been converted to use SetOf
    :LOGBOOK:
    CLOCK: [2023-10-20 Fri 11:05]--[2023-10-20 Fri 15:00] =>  3:55
    :END:
*** DONE Define injective spec -> data maps                           :@code:
    CLOSED: [2023-10-23 Mon 11:07]
    - State "DONE"       from "TODO"       [2023-10-23 Mon 11:07] \\
      Nonmalleability proven for everything up to certificate chains!
    :LOGBOOK:
    CLOCK: [2023-10-15 Sun 08:00]--[2023-10-15 Sun 14:30] =>  6:30
    CLOCK: [2023-10-05 Thu 08:50]--[2023-10-05 Thu 17:00] =>  8:10
    CLOCK: [2023-10-03 Tue 09:00]--[2023-10-03 Tue 16:40] =>  7:40
    CLOCK: [2023-09-27 Wed 11:45]--[2023-09-27 Wed 17:00] =>  5:15
    CLOCK: [2023-09-26 Tue 15:25]--[2023-09-26 Tue 18:25] =>  3:00
    CLOCK: [2023-09-21 Thu 08:30]--[2023-09-21 Thu 09:30] =>  1:00
    CLOCK: [2023-09-19 Tue 15:20]--[2023-09-19 Tue 18:00] =>  2:40
    CLOCK: [2023-09-18 Mon 13:50]--[2023-09-18 Mon 17:00] =>  3:10
    :END:
    - Note taken on [2023-09-16 Sat 09:51] \\
      It is important to note that the meaningfulness of the injectiveness part of
      nonmalleability property rests on the choice of the "raw" representation. We
      are defining injectivity here wrt a nonindexed datatype we map into, where that
      datatypes is meant to represent the purely computational component of the
      structure. But, it is easy to "cheat" at this, by an identity map into Exists---
      (List UInt8) A, which keeps all the specificational components. Thus, one
      potential weakeness (but also "challenge") is capturing the *two* specifications correctly.
    - Note taken on [2023-08-15 Tue 13:22] \\
      Non-malleable means:
      - /unique:/ there is only one value /v/ to be read from a bytestring /bs/
        This is already handled by the proofs that the grammar is /Unique/
      - /injective:/ should /v1/ be encoded by /bs1/, and /v2/ encoded by /bs/, and
        /v1 = v2/, then /bs1 = bs2/
      
      
      Currently, we can't state injectiveness because the specification includes the
      bytestring as part of the type. So, we need a non-indexed version of "value" so
      we can state this second part of /malleable/.
*** DONE Remove termination pragmas in the executable code            :@code:
    CLOSED: [2023-09-18 Mon 11:59]
    - State "DONE"       from "TODO"       [2023-09-18 Mon 11:59]
    :LOGBOOK:
    CLOCK: [2023-09-07 Thu 10:10]--[2023-09-07 Thu 13:15] =>  1:50
    CLOCK: [2023-09-05 Tue 09:55]--[2023-09-05 Tue 11:15] =>  1:20
    CLOCK: [2023-09-03 Sun 15:30]--[2023-09-03 Sun 17:00] =>  0:45
    CLOCK: [2023-09-01 Fri 14:10]--[2023-09-01 Fri 14:30] =>  0:20
    CLOCK: [2023-09-01 Fri 13:30]--[2023-09-01 Fri 14:05] =>  0:35
    :END:
*** DONE [#A] Fix strings specification                               :@code:
    CLOSED: [2023-09-18 Mon 11:59]
    - State "DONE"       from "TODO"       [2023-09-18 Mon 11:59]
    - Note taken on [2023-09-08 Fri 10:15] \\
      The length bounds for DisplayText don't appear to be correct... at least,
      we have found a cert that is longer than 200 bytes (because it uses UTF16
      encoding) 
    - State "DONE"       from "TODO"       [2023-09-08 Fri 08:55] \\
      Finished for now, though we don't support full UTF16
    :LOGBOOK:
    CLOCK: [2023-09-08 Fri 09:30]--[2023-09-08 Fri 13:30] =>  4:00
    CLOCK: [2023-09-05 Tue 15:30]--[2023-09-05 Tue 17:15] =>  1:45
    CLOCK: [2023-09-03 Sun 09:00]--[2023-09-03 Sun 13:25] =>  4:25
    :END:

    - Note taken on [2023-09-03 Sun 11:25] \\
      We discovered that BMP, universal, and other string types were not implemented
      correctly. The assumption was that these were UTF8, but they they were actually
      UTF16 and UTF32
*** DONE Decidable equality for =Unicode=                             :@code:
    CLOSED: [2023-09-08 Fri 08:55]
    - State "DONE"       from "TODO"       [2023-09-08 Fri 08:55] \\
      Finished for now, though we don't support full UTF16
    :LOGBOOK:
    CLOCK: [2023-09-05 Tue 11:15]--[2023-09-05 Tue 12:00] =>  0:45
    :END:
